## Staging: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 15 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                            NAME                                            |
|--------|--------------------------------------------------------------------------------------------|
| add    | `aws_lambda_function_url.scan_files_provisioned_url`                                       |
|        | `module.api_provisioned.aws_cloudwatch_log_group.this`                                     |
|        | `module.api_provisioned.aws_cloudwatch_query_definition.lambda_statistics`                 |
|        | `module.api_provisioned.aws_iam_policy.policies[0]`                                        |
|        | `module.api_provisioned.aws_iam_policy.policies[1]`                                        |
|        | `module.api_provisioned.aws_iam_policy.policies[2]`                                        |
|        | `module.api_provisioned.aws_iam_policy.vpc_policies[0]`                                    |
|        | `module.api_provisioned.aws_iam_role.this`                                                 |
|        | `module.api_provisioned.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0]` |
|        | `module.api_provisioned.aws_iam_role_policy_attachment.attachments[0]`                     |
|        | `module.api_provisioned.aws_iam_role_policy_attachment.attachments[1]`                     |
|        | `module.api_provisioned.aws_iam_role_policy_attachment.attachments[2]`                     |
|        | `module.api_provisioned.aws_iam_role_policy_attachment.lambda_insights[0]`                 |
|        | `module.api_provisioned.aws_iam_role_policy_attachment.vpc_policies[0]`                    |
|        | `module.api_provisioned.aws_lambda_function.this`                                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_function_url.scan_files_provisioned_url will be created
  + resource "aws_lambda_function_url" "scan_files_provisioned_url" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "scan-files-api-provisioned"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

  # module.api_provisioned.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/scan-files-api-provisioned"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # module.api_provisioned.aws_cloudwatch_query_definition.lambda_statistics will be created
  + resource "aws_cloudwatch_query_definition" "lambda_statistics" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "aws_cloudwatch_log_group.this",
        ]
      + name                = "Lambda Statistics - scan-files-api-provisioned"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter @type = “REPORT”
            | stats
            count(@type) as countInvocations,
            count(@initDuration) as countColdStarts, (count(@initDuration)/count(@type))*100 as percentageColdStarts,
            max(@initDuration) as maxColdStartTime,
            avg(@duration) as averageDuration,
            max(@duration) as maxDuration,
            min(@duration) as minDuration,
            avg(@maxMemoryUsed) as averageMemoryUsed,
            max(@memorySize) as memoryAllocated, (avg(@maxMemoryUsed)/max(@memorySize))*100 as percentageMemoryUsed
            by bin(1h) as timeFrame
        EOT
    }

  # module.api_provisioned.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "scan-files-api-provisioned-0"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:127893201980:log-group:*"
                    },
                  + {
                      + Action   = [
                          + "s3:Put*",
                          + "s3:ListBucketVersions",
                          + "s3:ListBucket",
                          + "s3:GetBucketLocation",
                          + "s3:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::scan-files-staging-file-queue/*",
                          + "arn:aws:s3:::scan-files-staging-file-queue",
                          + "arn:aws:s3:::scan-files-staging-clamav-defs/*",
                          + "arn:aws:s3:::scan-files-staging-clamav-defs",
                        ]
                    },
                  + {
                      + Action   = [
                          + "states:StopExecution",
                          + "states:ListStateMachines",
                          + "states:ListActivities",
                          + "states:DescribeExecution",
                          + "states:CreateActivity",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:states:ca-central-1:127893201980:*"
                    },
                  + {
                      + Action   = "states:StartExecution"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:states:ca-central-1:127893201980:stateMachine:assemblyline-file-scan-queue"
                    },
                  + {
                      + Action   = [
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:ca-central-1:127893201980:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:ca-central-1:127893201980:table/scan-locktable",
                          + "arn:aws:dynamodb:ca-central-1:127893201980:table/completed-scans",
                        ]
                    },
                  + {
                      + Action   = "ssm:GetParameters"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ca-central-1:127893201980:parameter/ENVIRONMENT_VARIABLES"
                    },
                  + {
                      + Action   = "lambda:InvokeFunction"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ca-central-1:127893201980:function:scan-files-api"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # module.api_provisioned.aws_iam_policy.policies[1] will be created
  + resource "aws_iam_policy" "policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "scan-files-api-provisioned-1"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:ca-central-1:127893201980:secret:/scan-files/api_auth_token-W7Y1XZ"
                    },
                  + {
                      + Action   = "kms:Decrypt"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ca-central-1:127893201980:key/37c5343c-414d-4019-8a00-2e7a1f4d5852"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # module.api_provisioned.aws_iam_policy.policies[2] will be created
  + resource "aws_iam_policy" "policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "scan-files-api-provisioned-2"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (sensitive value)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # module.api_provisioned.aws_iam_policy.vpc_policies[0] will be created
  + resource "aws_iam_policy" "vpc_policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "scan-files-api-provisioned_vpc"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:127893201980:repository/scan-files/api"
                      + Sid      = "ECRImageAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # module.api_provisioned.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scan-files-api-provisioned"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.api_provisioned.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0] will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "scan-files-api-provisioned"
    }

  # module.api_provisioned.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-files-api-provisioned"
    }

  # module.api_provisioned.aws_iam_role_policy_attachment.attachments[1] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-files-api-provisioned"
    }

  # module.api_provisioned.aws_iam_role_policy_attachment.attachments[2] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-files-api-provisioned"
    }

  # module.api_provisioned.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "scan-files-api-provisioned"
    }

  # module.api_provisioned.aws_iam_role_policy_attachment.vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-files-api-provisioned"
    }

  # module.api_provisioned.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "scan-files-api-provisioned"
      + id                             = (known after apply)
      + image_uri                      = "127893201980.dkr.ecr.ca-central-1.amazonaws.com/scan-files/api:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3008
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_AUTH_TOKEN_SECRET_ARN"    = "arn:aws:secretsmanager:ca-central-1:127893201980:secret:/scan-files/api_auth_token-W7Y1XZ"
              + "AV_DEFINITION_S3_BUCKET"      = "scan-files-staging-clamav-defs"
              + "AWS_MAX_ATTEMPTS"             = "5"
              + "AWS_RETRY_MODE"               = "standard"
              + "COMPLETED_SCANS_TABLE_NAME"   = "completed-scans"
              + "FILE_CHECKSUM_TABLE_NAME"     = "file-checksums"
              + "FILE_QUEUE_BUCKET"            = "scan-files-staging-file-queue"
              + "LOG_LEVEL"                    = "INFO"
              + "OPENAPI_URL"                  = "/openapi.json"
              + "POWERTOOLS_SERVICE_NAME"      = "scan-files-api"
              + "SCAN_QUEUE_STATEMACHINE_NAME" = "assemblyline-file-scan-queue"
              + "SQLALCHEMY_DATABASE_URI"      = (sensitive value)
            }
        }

      + ephemeral_storage {
          + size = 768
        }

      + logging_config {
          + application_log_level = (known after apply)
          + log_format            = (known after apply)
          + log_group             = (known after apply)
          + system_log_level      = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0c2fe8c812234753d",
              + "sg-0fd3857dd0bb31561",
            ]
          + subnet_ids                  = [
              + "subnet-000542edc6d13c9b4",
              + "subnet-06884bda4c6fc4ae9",
              + "subnet-0aa6a088aae229401",
            ]
          + vpc_id                      = (known after apply)
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 10 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sts"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_ip_set.ip_allowlist"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
